cf_billing/InformationRegisters/энргАбонентыПомещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргАбонентыПомещений</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Абонент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргАбоненты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ПериодРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>КлючПомещения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргКлючиПомещений</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/энргСтроения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>энргСтроения</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Бойлер</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБлагоустройства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОбъектаАбонентов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргВидыОбъектовАбонента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГодПостройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаПотребителейПоУмолчанию</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дом</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Корпус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаселенныйПункт</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Регион</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебныеЗаписки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПлиты</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыПлит</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Улица</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоЭтажей</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаршрутКонтроллера</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргМаршрутыКонтроллеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСтроения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.энргТипыСтроений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>удалитьФилиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргФилиалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УлицаНедобавленнаяВФИАС</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргУлицыНедобавленныеВФИАС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВетхостьСтроения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппаТочекПоставки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргГруппыТочекПоставки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОКТМО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>11</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыБлагоустройстваТарифныеКатегории</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваИндивидуальный</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидБлагоустройстваОбщедомовой</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыБлагоустройств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяКатегория</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргГруппыПотребителей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonModules/энргПользовательскийВводСервер/Ext/Module.bsl
#Область ОбработчикиСобытий

Процедура УстановитьЗависимыеРеквизитыАбонента(Абонент,Приемник) Экспорт
	ЗаполняемыеСвойстваАбонента = энргРаботаСЛицевымСчетомСервер.ЗаполняемыеСвойстваАбонентаПоУмолчанию();
	Результат = Обработки.энргАбонентыМенеджер.ЗначенияРеквизитовОбъекта(Абонент, ЗаполняемыеСвойстваАбонента);
	ЗаполнитьЗначенияСвойств(Приемник, Результат);	
КонецПроцедуры

Процедура УстановитьЗависимыеРеквизитыМКД(Строение,Приемник)  Экспорт 
	Запрос  		= Новый Запрос;
	Запрос.Текст 	=
	"ВЫБРАТЬ
	|	энргСтроения.Район КАК Район,
	|	энргСтроения.Организация КАК Организация
	|ИЗ
	|	Справочник.энргСтроения КАК энргСтроения
	|ГДЕ
	|	энргСтроения.Ссылка = &Строение";
	Запрос.УстановитьПараметр("Строение",Строение);
	Результат  			= Запрос.Выполнить();
	Выборка 		 	= Результат.Выбрать();
	Выборка.Следующий();
	ЗаполнитьЗначенияСвойств(Приемник,Выборка); 	
КонецПроцедуры

Функция ПрочитатьКлючПомещения(Строение,Помещение) Экспорт 
	Возврат Обработки.энргКлючиПомещенийМенеджер.КлючПомещенияПоСтроениюИПомещению(Строение,Помещение);	
КонецФункции

Функция ПрочитатьАбонентаПомещения(КлючПомещения,Район,Организация,Дата) Экспорт 
	Текст 			=
	"ВЫБРАТЬ
	|	энргАбонентыПомещенийСрезПоследних.Абонент КАК Абонент
	|ИЗ
	|	РегистрСведений.энргАбонентыПомещений.СрезПоследних(
	|			&Дата,
	|			Организация = &Организация
	|				И Район = &Район
	|				И КлючПомещения = &КлючПомещения) КАК энргАбонентыПомещенийСрезПоследних";
	
	Запрос  		= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Организация",	Организация);
	Запрос.УстановитьПараметр("Район",			Район);
	Запрос.УстановитьПараметр("КлючПомещения",	КлючПомещения);
	Запрос.УстановитьПараметр("Дата",			Дата);
	Результат  		= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Справочники.энргАбоненты.ПустаяСсылка();
	КонецЕсли;
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Абонент;
КонецФункции

Функция ПрочитатьКоличествоЖильцовПомещения(Строение, Помещение, ЧС, Организация, Район, ПериодНачисления) Экспорт 
	Текст 			=
	"ВЫБРАТЬ
	|	энргСтабильныеПериоды.ПериодНачисления КАК ПериодНачисления,
	|	энргСтабильныеПериоды.НомерПозиции КАК НомерПозиции,
	|	энргСтабильныеПериоды.КоличествоЖильцов КАК КоличествоЖильцов
	|ПОМЕСТИТЬ ВТ_ВсеЗаписи
	|ИЗ
	|	РегистрСведений.энргСтабильныеПериоды КАК энргСтабильныеПериоды
	|ГДЕ
	|	энргСтабильныеПериоды.Строение = &Строение
	|	И энргСтабильныеПериоды.Помещение = &Помещение
	|	И энргСтабильныеПериоды.ЧастныйСектор = &ЧастныйСектор
	|	И энргСтабильныеПериоды.Организация = &Организация
	|	И энргСтабильныеПериоды.Район = &Район
	|	И энргСтабильныеПериоды.ПериодНачисления < &ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписи.ПериодНачисления) КАК ПериодНачисления
	|ПОМЕСТИТЬ ВТ_МаксимПериод
	|ИЗ
	|	ВТ_ВсеЗаписи КАК ВТ_ВсеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ВсеЗаписи.ПериодНачисления КАК ПериодНачисления,
	|	МАКСИМУМ(ВТ_ВсеЗаписи.НомерПозиции) КАК НомерПозиции
	|ПОМЕСТИТЬ ВТ_МаксимНомерПозиции
	|ИЗ
	|	ВТ_ВсеЗаписи КАК ВТ_ВсеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимПериод КАК ВТ_МаксимПериод
	|		ПО ВТ_ВсеЗаписи.ПериодНачисления = ВТ_МаксимПериод.ПериодНачисления
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТ_ВсеЗаписи.ПериодНачисления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВТ_ВсеЗаписи.КоличествоЖильцов) КАК КоличествоЖильцов
	|ИЗ
	|	ВТ_ВсеЗаписи КАК ВТ_ВсеЗаписи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксимНомерПозиции КАК ВТ_МаксимНомерПозиции
	|		ПО ВТ_ВсеЗаписи.ПериодНачисления = ВТ_МаксимНомерПозиции.ПериодНачисления
	|			И ВТ_ВсеЗаписи.НомерПозиции = ВТ_МаксимНомерПозиции.НомерПозиции";
	
	Запрос  		= Новый Запрос(Текст);
	Запрос.УстановитьПараметр("Организация",		Организация);
	Запрос.УстановитьПараметр("Район",				Район);
	Запрос.УстановитьПараметр("Строение",			Строение);
	Запрос.УстановитьПараметр("Помещение",			Помещение);
	Запрос.УстановитьПараметр("ЧастныйСектор",		ЧС);
	Запрос.УстановитьПараметр("ПериодНачисления",	ПериодНачисления);
	Результат  		= Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат 1;
	КонецЕсли;
	Выборка  		= Результат.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.КоличествоЖильцов;
КонецФункции


#КонецОбласти

Процедура ЗаписатьПараметрыАбонента(Коллекция, ТекущийОбъект, ТолькоПрибор = Ложь) Экспорт  
	Сч	= 0;
	ИзмененныеАбоненты = Новый Массив;
	Для Каждого СтрокаАбонента Из Коллекция Цикл
				
		ЕстьДанные  								= Ложь;
		Запись  									= Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьНачалоОбъекта();
		Если ЗначениеЗаполнено(СтрокаАбонента.ЛицевойСчет) Тогда
			Запись.ЗаписатьИмяСвойства("ЛицевойСчет");
			Запись.ЗаписатьЗначение(СтрокаАбонента.ЛицевойСчет);
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаАбонента.ФизическоеЛицо) Тогда
			Запись.ЗаписатьИмяСвойства("ФизическоеЛицо");
			Запись.ЗаписатьЗначение("" + СтрокаАбонента.ФизическоеЛицо.УникальныйИдентификатор());
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаАбонента.ВидОбъекта) Тогда
			Запись.ЗаписатьИмяСвойства("ВидОбъекта");
			Запись.ЗаписатьЗначение("" + СтрокаАбонента.ВидОбъекта.УникальныйИдентификатор());
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаАбонента.КлючПомещения) Тогда
			Запись.ЗаписатьИмяСвойства("КлючПомещения");
			Запись.ЗаписатьЗначение("" + СтрокаАбонента.КлючПомещения.УникальныйИдентификатор());
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаАбонента.АдресОбъекта) Тогда
			//Запись.ЗаписатьИмяСвойства("АдресОбъекта");
			//Запись.ЗаписатьЗначение(СтрокаАбонента.АдресОбъекта);
			Запись.ЗаписатьИмяСвойства("АдресОбъектаЗначение");
			Запись.ЗаписатьЗначение(СтрокаАбонента.АдресОбъектаЗначение);
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаАбонента.Филиал) Тогда
			Запись.ЗаписатьИмяСвойства("Филиал");
			Запись.ЗаписатьЗначение("" + СтрокаАбонента.Филиал.УникальныйИдентификатор());
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(СтрокаАбонента,"СлужебныеОтметки") И ЗначениеЗаполнено(СтрокаАбонента.СлужебныеОтметки) Тогда
			Запись.ЗаписатьИмяСвойства("СлужебныеОтметки");
			Запись.ЗаписатьЗначение(СтрокаАбонента.СлужебныеОтметки);
			ЕстьДанные 								= Истина;
		КонецЕсли;
		
		Запись.ЗаписатьКонецОбъекта();
		ЗаписываемаяСтрока  						= ТекущийОбъект.Абоненты[Сч];
		ЗаписываемаяСтрока.ОписаниеАбонента 		= "";
		Если ЕстьДанные Тогда
			ЗаписываемаяСтрока.ОписаниеАбонента 	= Запись.Закрыть();
		КонецЕсли;
		
		Если СтрокаАбонента.СтрокаИзменена Тогда
			ИзмененныеАбоненты.Добавить(СтрокаАбонента.Абонент);
		КонецЕсли;
		Сч 											= Сч + 1;		
	КонецЦикла;
	
	ТекущийОбъект.ДополнительныеСвойства.Вставить("ИзмененныеАбоненты", 		ИзмененныеАбоненты);
КонецПроцедуры

Процедура ЗаписатьПараметрыМКД(Коллекция, ТекущийОбъект) Экспорт  
	Сч 											= 0;
	Для Каждого СтрокаМКД Из Коллекция Цикл
				
		ЕстьДанные  								= Ложь;
		Запись  									= Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		Запись.ЗаписатьНачалоОбъекта();
		Если ЗначениеЗаполнено(СтрокаМКД.ГодПостройки) Тогда
			Запись.ЗаписатьИмяСвойства("ГодПостройки");
			Запись.ЗаписатьЗначение(СтрокаМКД.ГодПостройки);
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаМКД.ВидОбъектаАбонентов) Тогда
			Запись.ЗаписатьИмяСвойства("ВидОбъектаАбонентов");
			Запись.ЗаписатьЗначение("" + СтрокаМКД.ВидОбъектаАбонентов.УникальныйИдентификатор());
			ЕстьДанные 								= Истина;
		КонецЕсли;
		Если ЗначениеЗаполнено(СтрокаМКД.ГруппаПотребителейПоУмолчанию) Тогда
			Запись.ЗаписатьИмяСвойства("ГруппаПотребителейПоУмолчанию");
			Запись.ЗаписатьЗначение("" + СтрокаМКД.ГруппаПотребителейПоУмолчанию.УникальныйИдентификатор());
			ЕстьДанные 								= Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаМКД.АдресОбъекта) Тогда
			Запись.ЗаписатьИмяСвойства("АдресОбъекта");
			Запись.ЗаписатьЗначение(СтрокаМКД.АдресОбъекта);
			Запись.ЗаписатьИмяСвойства("АдресОбъектаПредставлениеПолей");
			Запись.ЗаписатьЗначение(СтрокаМКД.АдресОбъектаПредставлениеПолей);
			ЕстьДанные 								= Истина;
		КонецЕсли;		
		Запись.ЗаписатьКонецОбъекта();
		ЗаписываемаяСтрока  						= ТекущийОбъект.Дома[Сч];
		ЗаписываемаяСтрока.ОписаниеМКД 		= "";
		Если ЕстьДанные Тогда
			ЗаписываемаяСтрока.ОписаниеМКД 	= Запись.Закрыть();
		КонецЕсли;
		Сч 											= Сч + 1;		
	КонецЦикла;
КонецПроцедуры

Процедура ЗаписатьПараметрыТочекИПриборовУчета(Коллекция, ТекущийОбъект, ТолькоПрибор = Ложь, ИмяКоллекции = "ТочкиУчета") Экспорт  
	Сч 											= 0;
	Для Каждого СтрокаТочки Из Коллекция Цикл
		ЗаписываемаяСтрока  					= ТекущийОбъект[ИмяКоллекции][Сч];
		Если Не ТолькоПрибор Тогда			
			ЗаписываемаяСтрока.ОписаниеТочки 	= Обработки.энргТочкиУчетаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(СтрокаТочки);			
		КонецЕсли;
		
		ЗаписываемаяСтрока.ОписаниеПрибора 		= Обработки.энргПриборыУчетаАбонентаМенеджер.ЗначенияРеквизитовОбъектаВСтрокуJSON(СтрокаТочки);		
		Сч 										= Сч + 1;		
	КонецЦикла;
КонецПроцедуры
